install.packages("dplyr")
library(dplyr)

data <- read.csv("C:/Users/YANG/Desktop/공모전준비/산재보험패널조사/01.SPSS/wide type.csv")


# 분석대상 추출 (재취업자 + 지속근무가능)
 
data_1 <- data %>% filter(emp016 == 2 & E201006005 == 1)
data_2 <- data %>% filter(emp026 == 2 & E202006005 == 1)
data_3 <- data %>% filter(emp036 == 2 & E203006005 == 1)
data_4 <- data %>% filter(emp046 == 2 & E204006005 == 1)
data_5 <- data %>% filter(emp056 == 2 & E205006005 == 1)



# 종속변수 설정

data_5$일자리만족도 <- data_5$E205009010     #범주형변수 - 순서형

data_5$자발적이직의도 <- data_5$E205010001 - 1  #범주형변수 - 명목형(이항변수)



# 독립변수 설정 (직무적합성)

data_5$직무수준_교육 <- data_5$E205007001  #범주형변수 - 순서형  # 리커트척도

data_5$직무수준_기술 <- data_5$E205007002 #범주형변수 - 순서형  # 리커트척도

data_5$직무유용성 <- data_5$E205007003 #범주형변수 - 순서형  # 리커트척도

data_5$직무적응도 <- data_5$E205003006 #범주형변수 - 순서형  # 리커트척도



### 일자리 만족도에 영향을 미치는 세부요인 - 순위별 ### (순서형로지스틱회귀)

data_5$임금_소득 <- data_5$E205009001
data_5$취업의안정성 <- data_5$E205009002
data_5$일의내용 <- data_5$E205009003
data_5$근로환경 <- data_5$E205009004
data_5$근로시간 <- data_5$E205009005
data_5$발전가능성 <- data_5$E205009006
data_5$의사소통_대인관계 <- data_5$E205009007
data_5$인사고과 <- data_5$E205009008
data_5$복리후생 <- data_5$E205009009

data_5$일자리만족도 <- factor(data_5$일자리만족도)

model1 <- lm(일자리만족도 ~ 임금_소득 + 취업의안정성 + 일의내용 + 근로환경 + 근로시간 +
                  발전가능성 + 의사소통_대인관계 + 인사고과 + 복리후생, data = data_5)

summary(model1)


## 재취업후 직무적합성이 "일자리만족도"에 미치는 영향 - 순서형로지스틱회귀 ##


model2 <- polr(일자리만족도 ~ 직무수준_교육 + 직무수준_기술 + 직무유용성 + 직무적응도, data = data_5, Hess = T)

summary(model2)


### 조절효과 반영해보기 ###




## 재취업후 직무적합성이 "자발적이직의도"에 미치는 영향 - 이항로지스틱회귀 ##

model3 <- glm(자발적이직의도 ~ 직무수준_교육 + 직무수준_기술 + 직무유용성 + 직무적응도, data = data_5, family = "binomial")

summary(model3)




## 재취업후 직무적합성이 "자발적이직행태"에 미치는 영향 - 다중명목로지스틱회귀 ##


